In [1]:
import pandas as pd
a=pd.read_csv('Dataset/Unemployment.csv')
a

     zip  unemployment  participants
0   1001          0.06         13801
1   1002          0.09         24551
2   1003          0.17         11477
3   1004          0.10          4086
4   1005          0.05         11362
5   1006          0.38          7898
6   1007          0.56          9465
7   1008          0.65           946
8   1009          0.76           976
9   1010          0.77           876
10  1011          0.78          1234

In [5]:
a.head(10)

    zip  unemployment  participants
0  1001          0.06         13801
1  1002          0.09         24551
2  1003          0.17         11477
3  1004          0.10          4086
4  1005          0.05         11362
5  1006          0.38          7898
6  1007          0.56          9465
7  1008          0.65           946
8  1009          0.76           976
9  1010          0.77           876

In [4]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
zip             11 non-null int64
unemployment    11 non-null float64
participants    11 non-null int64
dtypes: float64(1), int64(2)
memory usage: 304.0 bytes

In [9]:
a.index=a['zip']
a

       zip  unemployment  participants
zip
1001  1001          0.06         13801
1002  1002          0.09         24551
1003  1003          0.17         11477
1004  1004          0.10          4086
1005  1005          0.05         11362
1006  1006          0.38          7898
1007  1007          0.56          9465
1008  1008          0.65           946
1009  1009          0.76           976
1010  1010          0.77           876
1011  1011          0.78          1234

In [10]:
a.head()

       zip  unemployment  participants
zip
1001  1001          0.06         13801
1002  1002          0.09         24551
1003  1003          0.17         11477
1004  1004          0.10          4086
1005  1005          0.05         11362

In [12]:
a.head(3)

       zip  unemployment  participants
zip
1001  1001          0.06         13801
1002  1002          0.09         24551
1003  1003          0.17         11477

In [14]:
del a['zip']

In [16]:
a

      unemployment  participants
zip
1001          0.06         13801
1002          0.09         24551
1003          0.17         11477
1004          0.10          4086
1005          0.05         11362
1006          0.38          7898
1007          0.56          9465
1008          0.65           946
1009          0.76           976
1010          0.77           876
1011          0.78          1234

In [18]:
a.head(3)

      unemployment  participants
zip
1001          0.06         13801
1002          0.09         24551
1003          0.17         11477

In [20]:
a.index

Int64Index([1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010, 1011], dtype='int64', name='zip')

In [22]:
a.index.name

'zip'

In [24]:
a.columns

Index(['unemployment', 'participants'], dtype='object')

In [27]:
series=pd.read_csv('Dataset/Unemployment.csv',index_col='zip')
print(series)

      unemployment  participants
zip
1001          0.06         13801
1002          0.09         24551
1003          0.17         11477
1004          0.10          4086
1005          0.05         11362
1006          0.38          7898
1007          0.56          9465
1008          0.65           946
1009          0.76           976
1010          0.77           876
1011          0.78          1234

In [29]:
series.head()

      unemployment  participants
zip
1001          0.06         13801
1002          0.09         24551
1003          0.17         11477
1004          0.10          4086
1005          0.05         11362

In [31]:
series.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11 entries, 1001 to 1011
Data columns (total 2 columns):
unemployment    11 non-null float64
participants    11 non-null int64
dtypes: float64(1), int64(1)
memory usage: 264.0 bytes

In [35]:
df=pd.read_excel('Dataset/sales.xlsx',index_col='month');
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [37]:
df.head()

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Jan to Jun
Data columns (total 3 columns):
eggs    6 non-null int64
salt    5 non-null float64
spam    6 non-null int64
dtypes: float64(1), int64(2)
memory usage: 168.0+ bytes

In [42]:
df['salt']['Jan']
df['salt']['Feb']

50.0

In [44]:
df['eggs']['Jan']

47

In [48]:
print(df)
df.eggs['Mar']

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

221

In [52]:
df.loc['Jan','eggs']

47

In [54]:
df.iloc[4,2]

52

In [57]:
df_new=df[['salt','eggs']]
df_new

       salt  eggs
month
Jan    12.0    47
Feb    50.0   110
Mar    89.0   221
Apr    87.0    77
May     NaN   132
Jun    60.0   205